Lincoln 4H Analysis - Chart Review week 4

In [88]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [89]:
df = pd.read_csv("../data/Codeyou_4h_dataset.csv", header=1)

### Looking at the data to verify its read in correctly

In [90]:
df.head()
df.info()
df.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15 entries, 0 to 14
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   StudentID       15 non-null     int64
 1   Name            15 non-null     object
 2   Age             15 non-null     int64
 3   Clubs           15 non-null     object
 4   Hours_Per_Week  15 non-null     float64
 5   County          15 non-null     object
 6   School          15 non-null     object
 7   years_in_4h     15 non-null     int64
 8   zipcode         15 non-null     int64
 9   parent_contact  0 non-null      float64
 10  Tshirt_size     0 non-null      float64
dtypes: float64(3), int64(4), object(4)
memory usage: 1.4+ KB

,StudentID,Age,Hours_Per_Week,years_in_4h,zipcode,parent_contact,Tshirt_size
count,15.000000,15.000000,15.000000,15.000000,15.000000,0.0,0.0
mean,2118.000000,12.133333,2.933333,2.400000,40467.066667,NaN,NaN
std,4.472136,4.356713,1.590897,1.549193,30.433691,NaN,NaN
min,2111.000000,5.000000,1.000000,1.000000,40419.000000,NaN,NaN
25%,2114.500000,8.500000,2.000000,1.000000,40437.000000,NaN,NaN
50%,2118.000000,14.000000,2.500000,2.000000,40484.000000,NaN,NaN
75%,2121.500000,15.000000,3.750000,3.000000,40489.000000,NaN,NaN
max,2125.000000,18.000000,6.500000,5.000000,40489.000000,NaN,NaN

In [97]:
# Drop columns with more than 100% missing values
#df = df.drop(columns=['parent_contact', 'Tshirt_size'])

In [ ]:
# check for missing values
print(df.isnull().sum())

StudentID         0
Name              0
Age               0
Clubs             0
Hours_Per_Week    0
County            0
School            0
years_in_4h       0
zipcode           0
dtype: int64

In [98]:
# New df with only the columns we want to keep
clean_df = df[['StudentID', 'Name', 'Age', 'Clubs', 'Hours_Per_Week', 'County', 'School', 'years_in_4h', 'zipcode']]

# Save cleaned version to CSV without the index column
clean_df.to_csv('clean_lincoln_4h.csv', index=False)